INSERT INTO QuestionsStatus VALUES (1, 'Открыт'), (2, 'В работе'), (3, 'Закрыт');
GO

INSERT INTO AvailableCities VALUES ('Казань'), ('Москва'), ('Санкт-Петербург');
GO

INSERT INTO Cars (Brand, Model, Description, ImageSource) 
	VALUES ('Газ', '24', 'Пятиместный советский седан в комплектации эконом. (РКПП)', 'images/cars/gaz24.png'),
		   ('Volkswagen', 'Passat B8', 'Комфортный универсал в богатой комплектации. (АКПП)', 'images/cars/passat_b8.png'),
		   ('Nissan', 'Laurel', 'Седан бизнес-класса для людей с чувством стиля. (РКПП/АКПП)', 'images/cars/laurel.png'),
		   ('Nissan', 'Skyline', DEFAULT, null),
		   ('Hundai', 'Sonata', 'Седан бизнес класса с агрессивным дизайном. (АКПП)', 'images/cars/sonata.png'),
		   ('Mazda', 'MX-5', 'Родстер для настоящих ценителей. (РКПП/АКПП)', 'images/cars/mazda_mx5.png'),
		   ('Mazda', 'RX-7', 'Спортивное 4-местное купе с уникальным роторным двигателем. (РКПП/АКПП)', 'images/cars/mazda_rx7.png'),
		   ('Toyota', 'GT 86', 'Спортивное 2-местное купе. (РКПП)', 'images/cars/gt86.png'),
		   ('Hundai', 'Creta', 'Стильный полноприводный кроссовер, который станет вашим внимательным и умным помощником. (АКПП)', 'images/cars/creta.png'),
		   ('Audi', 'Q3', '5-местный кроссовер с автоматической коробкой передач.', 'images/cars/q3.png'),
		   ('Toyota', 'Highlander', '5(+2)-местный кроссовер с автоматической коробкой передач.', 'images/cars/highlander.png'),
		   ('Hundai', 'H1', '8-местный микроавтобус в комплектации Business. Отличный автомобиль для путешественников и больших семей. (АКПП)', 'images/cars/h1.png'),
		   ('Mercedes-Benz', 'Vito 3', '8-местный микроавтобус в комплектации Business. Отличный автомобиль для путешественников и больших семей. (АКПП)', 'images/cars/vito.png')
GO

INSERT INTO CarPark (Car, RegisterSign, City, IsBusy, IsReserved) VALUES
					(1, 'С001КС77', 1, 0, 0), (1, 'С003КС77', 2, 0, 0),
					(1, 'С002КС77', 2, 0, 0), (2, 'С100КС777', 1, 0, 0),
					(2, 'С101КС777', 1, 0, 0), (2, 'С102КС777', 1, 0, 0),
					(2, 'С103КС777', 2, 0, 0), (2, 'С104КС777', 2, 0, 0),
					(2, 'С105КС777', 2, 0, 0), (2, 'С106КС777', 3, 0, 0),
					(2, 'С107КС777', 3, 0, 0), (2, 'С108КС777', 3, 0, 0),
					(3, 'С200КС77', 3, 0, 0),  (3, 'С201КС77', 3, 0, 0),
					(5, 'С300КС77', 3, 0, 0), (5, 'С301КС77', 1, 0, 0),
					(6, 'С400КС777', 1, 0, 0), (6, 'С401КС777', 1, 0, 0),
					(6, 'С403КС777', 2, 0, 0), (6, 'С404КС777', 2, 0, 0),
					(6, 'С405КС777', 3, 0, 0), (6, 'С406КС777', 3, 0, 0),
					(7, 'С407КС777', 2, 0, 0), (7, 'С408КС777', 2, 0, 0),
					(7, 'С409КС777', 3, 0, 0), (7, 'С410КС777', 3, 0, 0),
					(8, 'С411КС777', 1, 0, 0), (8, 'С412КС777', 1, 0, 0),
					(8, 'С413КС777', 2, 0, 0), (9, 'С414КС777', 1, 0, 0),
					(9, 'С415КС777', 1, 0, 0), (9, 'С416КС777', 1, 0, 0),
					(9, 'С417КС777', 1, 0, 0), (9, 'С418КС777', 2, 0, 0),
					(9, 'С419КС777', 2, 0, 0), (9, 'С420КС777', 2, 0, 0),
					(9, 'С421КС777', 2, 0, 0), (9, 'С422КС777', 3, 0, 0),
					(9, 'С423КС777', 3, 0, 0), (9, 'С424КС777', 3, 0, 0),
					(9, 'С425КС777', 3, 0, 0), (10, 'С501КС716', 1, 0, 0),
					(10, 'С502КС716', 1, 0, 0), (10, 'С501КС777', 2, 0, 0),
					(10, 'С502КС777', 2, 0, 0), (11, 'С600КС116', 1, 0, 0),
					(11, 'С601КС116', 1, 0, 0), (11, 'С602КС116', 2, 0, 0),
					(11, 'С603КС116', 2, 0, 0), (11, 'С604КС116', 3, 0, 0),
					(11, 'С605КС116', 3, 0, 0), (12, 'С600КС716', 1, 0, 0),
					(12, 'С601КС716', 1, 0, 0), (12, 'С602КС716', 2, 0, 0),
					(12, 'С603КС716', 2, 0, 0), (12, 'С604КС716', 3, 0, 0),
					(12, 'С605КС716', 3, 0, 0), (13, 'С700КС116', 2, 0, 0),
					(13, 'С701КС116', 3, 0, 0), (13, 'С702КС116', 3, 0, 0)




INSERT INTO Tariffs VALUES ('Everyday', ' ', 9500, 6),
						   ('Everyday', ' ', 10000, 7),
						   ('Everyday', ' ', 7000, 9),
						   ('Everyday', ' ', 8000, 12),
						   ('Everyday', ' ', 6500, 10),
						   ('Whatever You Want', ' ', 6000, 8),
						   ('Whatever You Want', ' ', 4000, 1),
						   ('Whatever You Want', ' ', 6550, 2),
						   ('Whatever You Want', ' ', 6000, 4),
						   ('Whatever You Want', ' ', 6000, 3),
						   ('Whatever You Want', ' ', 8000, 12),
						   ('Whatever You Want', ' ', 7700, 13),
						   ('Travel', ' ', 6700, 5),
						   ('Travel', ' ', 7000, 2),
						   ('Travel', ' ', 7550, 11),
						   ('Travel', ' ', 5700, 13);
GO